/*
转载：为什么要对URI进行编码  2011-12-05 17:03:57|  分类： 默认分类 |  标签：uri编码   |举报 |字号大

为什么需要Url编码，通常如果一样东西需要编码，说明这样东西并不适合传输。原因多种多样，如Size过大，包含隐私数据，对于Url来说，之所 
以要进行编码，是因为Url中有些字符会引起歧义。 例如Url参数字符串中使用key=value键值对这样的形式来传参，键值对之间以&符号分隔，
如/s?q=abc&ie=utf- 8。如果你的value字符串中包含了=或者&，那么势必会造成接收Url的服务器解析错误，因此必须将引起歧义的&和=符号进
行转义， 也就是对其进行编码。 又如，Url的编码格式采用的是ASCII码，而不是Unicode，这也就是说你不能在Url中包含任何非ASCII字符，
例如中文。否则如果客户端浏 览器和服务端浏览器支持的字符集不同的情况下，中文可能会造成问题。

Url编码的原则就是使用安全的字符（没有特殊用途或者特殊意义的可打印字符）去表示那些不安全的字符。 哪些字符需要编码 RFC3986文档规定，
Url中只允许包含英文字母（a-zA-Z）、数字（0-9）、-_.~4个特殊字符以及所有保留字符。 RFC3986文档对Url的编解码问题做出了详细的建议，
指出了哪些字符需要被编码才不会引起Url语义的转变，以及对为什么这些字符需要编码做出了相 应的解释。 US-ASCII字符集中没有对应的可打
印字符 Url中只允许使用可打印字符。US-ASCII码中的10-7F字节全都表示控制字符，这些字符都不能直接出现在Url中。同时，对于80-FF字
节 （ISO-8859-1），由于已经超出了US-ACII定义的字节范围，因此也不可以放在Url中。

保留字符 Url可以划分成若干个组件，协议、主机、路径等。有一些字符（:/?#[]@）是用作分隔不同组件的。例如:冒号用于分隔协议和主机
，/用于分隔主机和 路径，?用于分隔路径和查询参数，等等。还有一些字符（!$&’()*+,;=）用于在每个组件中起到分隔作用的，如=用于
表示查询参数中的键值 对，&符号用于分隔查询多个键值对。当组件中的普通数据包含这些特殊字符时，需要对其进行编码。

RFC3986中指定了以下字符为保留字符： ! * ‘ ( ) ; : @ & = + $ , / ? # [ ] 不安全字符 还有一些字符，当他们直接放在Url中的时候，
可能会引起解析程序的歧义。这些字符被视为不安全字符，原因有很多。 空格 Url在传输的过程，或者用户在排版的过程，或者文本处理程
序在处理Url的过程，都有可能引入无关紧要的空格，或者将那些有意义的空格给去掉 引号以及<> 引号和尖括号通常用于在普通文本中起到
分隔Url的作用 # 通常用于表示书签或者锚点 % 百分号本身用作对不安全字符进行编码时使用的特殊字符，因此本身需要编码 {}|\^[]`~ 
某一些网关或者传输代理会篡改这些字符 

需要注意的是，对于Url中的合法字符，编码和不编码是等价的，但是对于上面提到的这些字符，如果不经过编码，那么它们有可能会造成Url
语义的不同。因 此对于Url而言，只有普通英文字符和数字，特殊字符$-_.+!*’()还有保留字符，才能出现在未经编码的Url之中。其他字符
均需要经过编码之后才 能出现在Url中。

Javascript中提供了3对函数用来对Url编码以得到合法的Url，它们分别是escape / unescape,encodeURI / decodeURI和encodeURIComponent 
/ decodeURIComponent。由于解码和编码的过程是可逆的，因此这里只解释编码的过程。 这三个编码的函数――escape，encodeURI，encodeURIComponent
――都是用于将不安全不合法的Url字符转换为合法的 Url字符表示，它们有以下几个不同点。 

安全字符不同 下面的表格列出了这三个函数的安全字符（即函数不会对这些字符进行编码） 
安全字符 escape（69个） * /@+-._0-9a-zA-Z encodeURI（82个） !#$&’()*+,/:;=?@-._~0-9a-zA-Z encodeURIComponent（71个） !’()*-._~0-9a-zA-Z 
兼容性不同 escape函数是从Javascript1.0的时候就存在了，其他两个函数是在Javascript1.5才引入的。但是由于 Javascript1.5已经非常普及了，所
以实际上使用encodeURI和encodeURIComponent并不会有什么兼容性问题。

对Unicode字符的编码方式不同 这三个函数对于ASCII字符的编码方式相同，均是使用百分号+两位十六进制字符来表示。但是对于Unicode字
符，escape的编码方式 是%uxxxx，其中的xxxx是用来表示unicode字符的4位十六进制字符。这种方式已经被W3C废弃了。但是在ECMA-262标准
中仍然保留着 escape的这种编码语法。encodeURI和encodeURIComponent则使用UTF-8对非ASCII字符进行编码，然后再进行百分号 编码。这是
RFC推荐的。因此建议尽可能的使用这两个函数替代escape进行编码。

适用场合不同 encodeURI被用作对一个完整的URI进行编码，而encodeURIComponent被用作对URI的一个组件进行编码。 从上面提到的安全字符范
围表格来看，我们会发现，encodeURIComponent编码的字符范围要比encodeURI的大。我们上面提到过，保留 字符一般是用来分隔URI组件（一
个URI可以被切割成多个组件，参考预备知识一节）或者子组件（如URI中查询参数的分隔符），如:号用于分隔 scheme和主机，?号用于分隔主
机和路径。由于encodeURI操纵的对象是一个完整的的URI，这些字符在URI中本来就有特殊用途，因此这些保 留字符不会被encodeURI编码，否
则意义就变了。 组件内部有自己的数据表示格式，但是这些数据内部不能包含有分隔组件的保留字符，否则就会导致整个URI中组件的分隔混乱。
因此对于单个组件使用 encodeURIComponent，需要编码的字符就更多了。 




地址栏中的问号有什么作用
比如这样的链接：
http://www.xxx.com/Show.asp?id=77&nameid=2905210001&page=1
在这样的链接中，问号的含义不是上面文章中所提到的版本号问题，而是传递参数的作用。这个问号将show.asp文件和后面的id、nameid、page等连接起来。

除此之外，链接中的问号还有一个作用，就是清除缓存的作用。

比如这样的链接：
http://www.xxxxx.com/index.html 和 http://www.xxxxx.com/index.html?test123123
第一个链接和第二个链接虽然打开的是同一个首页文件，但效果可能会不相同。

因为后面的链接中带有问号，后面还添加了一些字符，浏览器就会认为这是一个新的地址，而不是读取原来的那个index.html文件在电脑中的缓存。
与其说这个功能是清除缓存，不如说是让旧地址变成新地址更恰当。正因为加了问号，浏览器认为它是一个新地址，就会重新读取

例如Url参数字符串中使用key=value键值对这样的形式来传参，键值对之间以&符号分隔，如/s?q=abc& ie=utf-8。如果你的value字符串中包含了=或者&，
那么势必会造成接收Url的服务器解析错误，因此必须将引起歧义的&和= 符号进行转义，也就是对其进行编码。

Url编码的原则就是使用安全的字符（没有特殊用途或者特殊意义的可打印字符）去表示那些不安全的字符。

需要注意的是，对于Url中的合法字符，编码和不编码是等价的，但是对于上面提到的 这些字符，如果不经过编码，那么它们有可能会造成Url语义的不同。
因此对于Url而言，只有普通英文字符和数字，特殊字符$-_.+!*'()还有保留 字符，才能出现在未经编码的Url之中。其他字符均需要经过编码之后才能出现在Url中。


不安全字符还有一些字符，当他们直接放在Url中的时候，可能会引起解析程序的歧义。这些字符被视为不安全字符，原因有很多。

空格 Url在传输的过程，或者用户在排版的过程，或者文本处理程序在处理Url的过程，都有可能引入无关紧要的空格，或者将那些有意义的空格给去掉 
引号以及<> 引号和尖括号通常用于在普通文本中起到分隔Url的作用 
# 通常用于表示书签或者锚点 
% 百分号本身用作对不安全字符进行编码时使用的特殊字符，因此本身需要编码 
{}|\^[]`~ 某一些网关或者传输代理会篡改这些字符 

对于Url而言，只有普通英文字符和数字，特殊字符$-_.+!*'()还有保留 字符，才能出现在未经编码的Url之中。其他字符均需要经过编码之后才能出现在Url中。

如何对Url中的非法字符进行编码
Url编码通常也被称为百分号编码（Url Encoding，also known as percent-encoding），是因为它的编码方式非常简单，使用%百分号加上两位的字符——0123456789ABCDEF——代表一个字节的 十六进制形式。Url编码默认使用的字符集是US-ASCII。例如a在US-ASCII码中对应的字节是0x61，那么Url编码之后得到的就 是%61，我们在地址栏上输入http://g.cn/search?q=%61%62%63，实际上就等同于在google上搜索abc了。又如@符号 在ASCII字符集中对应的字节为0x40，经过Url编码之后得到的是%40。

常见字符的Url编码列表：

保留字符的Url编码 
!  *     "    '  (   )   ;    :   @  & 
%21 %2A %22 %27 %28 %29 %3B %3A %40 %26 
=    +   $   ,   /   ?   %   #   [   ] 
%3D %2B %24 %2C %2F %3F %25 %23 %5B %5D 



这篇知识很好:http://www.cnblogs.com/leaven/archive/2012/07/12/2588746.html
*/
